src/Enums/ЖИПК_РеглЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ЖИПК_РеглЗадание</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчитатьХэшСуммыРасширений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчитатьХешСуммыДополнительных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчитатьХэшСуммуКонфигурации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ЖИПК_РеглЗадание/Ext/Module.bsl
#Область ПрограммныйИнтерфейс 

Процедура ОбработатьРегламентноеЗадание(ИдентификаторЗадания) Экспорт

	Если ИдентификаторЗадания = Перечисления.ЖИПК_РеглЗадание.РасчитатьХешСуммыДополнительных Тогда
		
		ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыДополнительных();
		
	КонецЕсли;
	
	Если ИдентификаторЗадания = Перечисления.ЖИПК_РеглЗадание.РасчитатьХэшСуммуКонфигурации Тогда
		
		ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыКонфигурации();
		
	КонецЕсли;
	
	Если ИдентификаторЗадания = Перечисления.ЖИПК_РеглЗадание.РасчитатьХэшСуммыРасширений Тогда
		
		ЖИПК_АнализПрикладныхРешенийРегл.ВыполнитьЗаписьХешСуммыРасширений();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
